name: "ir50_onnx"
platform: "onnxruntime_onnx"
backend: "onnxruntime"
max_batch_size: 16
input [
    {
        name: "input.1"
        data_type: TYPE_FP32
        format: FORMAT_NCHW
        dims: [3, 112, 112]
    }
]
output [
    {
        name: "559"
        data_type: TYPE_FP32
        dims: [512]

    }
]
instance_group [
    {
      count: 4
      kind: KIND_GPU
      gpus: [ 0 ]
    }
 ]

 dynamic_batching {
    preferred_batch_size: [ 8, 16 ]
    max_queue_delay_microseconds: 1
 }