name: "ir50_onnx"
platform: "onnxruntime_onnx"
backend: "onnxruntime"
max_batch_size: 32
input [
    {
        name: "input.1"
        data_type: TYPE_FP32
        format: FORMAT_NCHW
        dims: [3, 112, 112]
    }
]
output [
    {
        name: "559"
        data_type: TYPE_FP32
        dims: [512]

    }
]

